strich/strich.org
#+STARTUP: indent
#+TITLE: Strich: My configuration file for Emacs
#+AUTHOR: Mahito TANNO
#+DATE:
#+EXPORT_FILE_NAME: ./doc/index.html
#+OPTIONS: H:2
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="worg.css"/>

* Introduction
** Strich
~strich.el~ は個人的な Emacs の設定をまとめたものです．
Emacs バージョン 25.4 以降での利用を想定しています．
特にバージョン 26 以降での利用を強く勧めます．

Strich とは角度の単位の一つです (参考 [[https://de.wikipedia.org/wiki/Strich_(Winkeleinheit)][Wikpedia]] )．

Strich は以下に強い影響を受けました．

- radian
- Centaur Emacs
- doom-emacs
- Ladicle Emacs

Strich を編集する際は ~strich.el~ ではなく ~strich.org~ を編集します．
編集後に =org-babel-tangle-file= を用いて ~strich.el~ を生成します．

#+begin_src emacs-lisp :exports none
  ;;; strich.el --- My configuration file for Emacs -*- lexical-binding:t -*-

  ;; Copyright (C) 2019  TANNO Mahito

  ;; This program is free software: you can redistribute it and/or modify
  ;; it under the terms of the GNU General Public License as published by
  ;; the Free Software Foundation, either version 3 of the License, or
  ;; (at your option) any later version.

  ;; This program is distributed in the hope that it will be useful,
  ;; but WITHOUT ANY WARRANTY; without even the implied warranty of
  ;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  ;; GNU General Public License for more details.

  ;; You should have received a copy of the GNU General Public License
  ;; along with this program.  If not, see <http://www.gnu.org/licenses/>.

  ;;; Commentary:

  ;; `strich.el' is my configuration for Emacs.  You can get details in
  ;; `strich.org' or in `strich.html' generated by Org-mode.

  ;; Do not edit this file directly.  If you want to edit `strich.el',
  ;; you must edit `strich.org' instead.

  ;;; Code:
#+end_src
** init.el
~init.el~ は ~strich.el~ を読み込みます．
ただし Emacs のバージョンが古い場合は ~strich.el~ は読み込まれません．

#+begin_src emacs-lisp :tangle no
  (defvar strich-minimum-emacs-version "25.4")

  (if (version< emacs-version strich-minimum-version)
      (error (concat "Strich requires Emacs ver. %s or later, "
                     "but you use Emacs ver. %s!")
             strich-minimum-emacs-version emacs-version)
    (require 'strich (locate-user-emacs-file "strich.el") t))
#+end_src

* Fundamental 
** Variables
#+begin_src emacs-lisp
  (defgroup strich nil
    "Customize your Emacs configuration via Strich."
    :prefix "strich-"
    :group 'emacs
    :link '(url-link :tag "GitHub" "https://github.com/mahito1594/dotemacs"))
#+end_src

#+begin_src emacs-lisp
  (defvar strich-locate-strich-elisp-file (expand-file-name (concat user-emacs-directory
                                                                    "strich/strich.el"))
    "Place where `strich.el' should be.")

  (defvar strich-locate-strich-org-file (expand-file-name (concat user-emacs-directory
                                                                  "strich/strich.org"))
    "Place where `strich.org' should be.")

  (defvar strich-locate-strich-html-file (expand-file-name (concat user-emacs-directory
                                                                   "strich/doc/index.html"))
    "Place where `strich.html' shouled be.")
#+end_src

#+begin_src emacs-lisp
  (defcustom strich-backup-directory (locate-user-emacs-file "backups/")
    "We save automatically files into the directory:
  We set `backup-directory-alist' and `auto-save-file-name-transforms' to `strich-backup-directory'."
    :type 'directory
    :group 'strich)
#+end_src

