strich/doc/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-03-28 Thu 17:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Strich: My configuration file for Emacs</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mahito TANNO" />
<link rel="stylesheet" type="text/css" href="worg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Strich: My configuration file for Emacs</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6ed77bd">1. Introduction</a>
<ul>
<li><a href="#org0236a5a">1.1. Strich</a></li>
<li><a href="#orga9ac94f">1.2. init.el</a></li>
</ul>
</li>
<li><a href="#orgc41ffed">2. Fundamental</a>
<ul>
<li><a href="#orge962b01">2.1. Variables</a></li>
<li><a href="#orgec8a329">2.2. Functions</a></li>
<li><a href="#orgb7f6f25">2.3. Package manager</a></li>
<li><a href="#org5210128">2.4. Some package</a></li>
</ul>
</li>
<li><a href="#orgc6561c8">3. Utilities</a>
<ul>
<li><a href="#org86e2662">3.1. Language, Codings</a></li>
<li><a href="#org346b3c2">3.2. Exec path</a></li>
<li><a href="#orgddd4c26">3.3. Server</a></li>
<li><a href="#orgd9486e5">3.4. Backup files</a></li>
<li><a href="#orgcb1ca95">3.5. Directories</a></li>
<li><a href="#org9188e38">3.6. Candidates</a></li>
<li><a href="#org4c13903">3.7. Others</a></li>
</ul>
</li>
<li><a href="#org93aee98">4. Completion and syntax checking</a>
<ul>
<li><a href="#org7e020ab">4.1. Yasnippet</a></li>
<li><a href="#orgb5f2c7a">4.2. Company</a></li>
<li><a href="#org2e200f7">4.3. Flycheck</a></li>
<li><a href="#orgb79a255">4.4. LSP</a></li>
</ul>
</li>
<li><a href="#org59218df">5. Programming Languages</a>
<ul>
<li><a href="#org5081f2c">5.1. C/C++</a></li>
<li><a href="#org8cbc663">5.2. Emacs Lisp</a></li>
<li><a href="#org022420d">5.3. Ocaml</a></li>
<li><a href="#orgd2e696b">5.4. Python</a></li>
</ul>
</li>
<li><a href="#orgb7c297b">6. Documents</a>
<ul>
<li><a href="#org38d4a48">6.1. TeX/LaTeX</a></li>
<li><a href="#orgeb2fdfc">6.2. Org-mode</a></li>
</ul>
</li>
<li><a href="#org00140f2">7. Appearance</a>
<ul>
<li><a href="#org4ab4928">7.1. Color theme</a></li>
<li><a href="#org38da76a">7.2. Frame</a></li>
<li><a href="#org4901796">7.3. Font</a></li>
</ul>
</li>
<li><a href="#org5c9b7b7">8. Global keybindings</a></li>
<li><a href="#orgd12d59b">9. License</a></li>
</ul>
</div>
</div>

<div id="outline-container-org6ed77bd" class="outline-2">
<h2 id="org6ed77bd"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org0236a5a" class="outline-3">
<h3 id="org0236a5a"><span class="section-number-3">1.1</span> Strich</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<code>strich.el</code> は個人的な Emacs の設定をまとめたものです．
Emacs バージョン 25.4 以降での利用を想定しています．
特にバージョン 26 以降での利用を強く勧めます．
</p>

<p>
Strich とは角度の単位の一つです (参考 <a href="https://de.wikipedia.org/wiki/Strich_(Winkeleinheit)">Wikpedia</a> )．
</p>

<p>
Strich は以下に強い影響を受けました．
</p>

<ul class="org-ul">
<li>radian</li>
<li>Centaur Emacs</li>
<li>doom-emacs</li>
<li>Ladicle Emacs</li>
</ul>

<p>
Strich を編集する際は <code>strich.el</code> ではなく <code>strich.org</code> を編集します．
編集後に <code>org-babel-tangle-file</code> を用いて <code>strich.el</code> を生成します．
</p>
</div>
</div>

<div id="outline-container-orga9ac94f" class="outline-3">
<h3 id="orga9ac94f"><span class="section-number-3">1.2</span> init.el</h3>
<div class="outline-text-3" id="text-1-2">
<p>
<code>init.el</code> は <code>strich.el</code> を読み込みます．
ただし Emacs のバージョンが古い場合は <code>strich.el</code> は読み込まれません．
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defvar</span> <span class="org-variable-name">strich-minimum-emacs-version</span> <span class="org-string">"25.4"</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">(</span>version&lt; emacs-version strich-minimum-version<span class="org-rainbow-delimiters-depth-2">)</span>
    <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-warning">error</span> <span class="org-rainbow-delimiters-depth-3">(</span>concat <span class="org-string">"Strich requires Emacs ver. %s or later, "</span>
                   <span class="org-string">"but you use Emacs ver. %s!"</span><span class="org-rainbow-delimiters-depth-3">)</span>
           strich-minimum-emacs-version emacs-version<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">require</span> '<span class="org-constant">strich</span> <span class="org-rainbow-delimiters-depth-3">(</span>locate-user-emacs-file <span class="org-string">"strich.el"</span><span class="org-rainbow-delimiters-depth-3">)</span> t<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc41ffed" class="outline-2">
<h2 id="orgc41ffed"><span class="section-number-2">2</span> Fundamental</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orge962b01" class="outline-3">
<h3 id="orge962b01"><span class="section-number-3">2.1</span> Variables</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defgroup</span> <span class="org-type">strich</span> nil
  <span class="org-doc">"Customize your Emacs configuration via Strich."</span>
  <span class="org-builtin">:prefix</span> <span class="org-string">"strich-"</span>
  <span class="org-builtin">:group</span> 'emacs
  <span class="org-builtin">:link</span> '<span class="org-rainbow-delimiters-depth-2">(</span>url-link <span class="org-builtin">:tag</span> <span class="org-string">"GitHub"</span> <span class="org-string">"https://github.com/mahito1594/dotemacs"</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defvar</span> <span class="org-variable-name">strich-locate-strich-elisp-file</span> <span class="org-rainbow-delimiters-depth-2">(</span>expand-file-name <span class="org-rainbow-delimiters-depth-3">(</span>concat user-emacs-directory
                                                                  <span class="org-string">"strich/strich.el"</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-doc">"Place where `</span><span class="org-doc"><span class="org-constant">strich.el</span></span><span class="org-doc">' should be."</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defvar</span> <span class="org-variable-name">strich-locate-strich-org-file</span> <span class="org-rainbow-delimiters-depth-2">(</span>expand-file-name <span class="org-rainbow-delimiters-depth-3">(</span>concat user-emacs-directory
                                                                <span class="org-string">"strich/strich.org"</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-doc">"Place where `</span><span class="org-doc"><span class="org-constant">strich.org</span></span><span class="org-doc">' should be."</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defvar</span> <span class="org-variable-name">strich-locate-strich-html-file</span> <span class="org-rainbow-delimiters-depth-2">(</span>expand-file-name <span class="org-rainbow-delimiters-depth-3">(</span>concat user-emacs-directory
                                                                 <span class="org-string">"strich/doc/strich.html"</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-doc">"Place where `</span><span class="org-doc"><span class="org-constant">strich.html</span></span><span class="org-doc">' shouled be."</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defcustom</span> <span class="org-variable-name">strich-backup-directory</span> <span class="org-rainbow-delimiters-depth-2">(</span>locate-user-emacs-file <span class="org-string">"backups/"</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-doc">"We save automatically files into the directory:</span>
<span class="org-doc">We set `</span><span class="org-doc"><span class="org-constant">backup-directory-alist</span></span><span class="org-doc">' and `</span><span class="org-doc"><span class="org-constant">auto-save-file-name-transforms</span></span><span class="org-doc">' to `</span><span class="org-doc"><span class="org-constant">strich-backup-directory</span></span><span class="org-doc">'."</span>
  <span class="org-builtin">:type</span> 'directory
  <span class="org-builtin">:group</span> 'strich<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
