strich/strich.org
** Functions
#+begin_src emacs-lisp
  (defun strich-open-html-doc ()
    "Open Strich document in default browser."
    (interactive)
    (browse-url-of-file strich-locate-strich-html-file))

  (defun strich-open-org-doc ()
    "Open Strich document in Org-mode."
    (interactive)
    (view-file strich-locate-strich-org-file))
#+end_src

#+begin_src emacs-lisp
  (defun strich-edit-strich ()
    "Open `strich.org' to edit."
    (interactive)
    (find-file strich-locate-strich-org-file))
#+end_src

#+begin_src emacs-lisp
  (defun strich-make-init-elisp ()
    "Make `strich.el' with `org-babel-tangle'."
    (interactive)
    (with-current-buffer
        (find-file-noselect strich-locate-strich-org-file)
      (org-babel-tangle))
    (write-region (concat ";; Local Variables:\n"
                          ";; buffer-read-only: t\n"
                          ";; End:")
                  nil strich-locate-strich-elisp-file 'append)
    (message "%s is created!" strich-locate-strich-elisp-file))
#+end_src

#+begin_src emacs-lisp
  (defun strich-make-document-html ()
    "Make document html file."
    (interactive)
    (straight-use-package 'org)
    (straight-use-package 'htmlize)
    (with-current-buffer (find-file-noselect strich-locate-strich-org-file)
      (setq-local org-html-htmlize-output-type 'css)
      (org-html-export-to-html)))
#+end_src

** Package manager
Strich はパッケージマネージャとして ~straight.el~ と ~use-package.el~ を利用します

*** straight.el
[[https://github.com/raxod502/straight.el][straight.el]] は Emacs のパッケージマネージャの 1 つです．

#+begin_quote
next-generation, purely functional package manager for the Emacs hacker.
#+end_quote

~develop~ ブランチの ~straight.el~ をインストールします．

デフォルトのままでは Emacs の起動が遅くなるので ~straight-check-for-modifications~ を ~live-with-find~ に設定しておきます．
~live-with-find~ は ~(check-on-save find-when-checking)~ と等価です．

#+begin_src emacs-lisp
  (setq straight-repository-branch "develop") ; use the develop branch of straight.el
  (setq straight-check-for-modifications 'live-with-find) ; => '(check-on-save find-when-checking)
  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
        (bootstrap-version 5))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))
#+end_src

