strich/doc/index.html

<div id="outline-container-orgec8a329" class="outline-3">
<h3 id="orgec8a329"><span class="section-number-3">2.2</span> Functions</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defun</span> <span class="org-function-name">strich-open-html-doc</span> <span class="org-rainbow-delimiters-depth-2">()</span>
  <span class="org-doc">"Open Strich document in default browser."</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">interactive</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>browse-url-of-file strich-locate-strich-html-file<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defun</span> <span class="org-function-name">strich-open-org-doc</span> <span class="org-rainbow-delimiters-depth-2">()</span>
  <span class="org-doc">"Open Strich document in Org-mode."</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">interactive</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>view-file strich-locate-strich-org-file<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defun</span> <span class="org-function-name">strich-edit-strich</span> <span class="org-rainbow-delimiters-depth-2">()</span>
  <span class="org-doc">"Open `</span><span class="org-doc"><span class="org-constant">strich.org</span></span><span class="org-doc">' to edit."</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">interactive</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>find-file strich-locate-strich-org-file<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defun</span> <span class="org-function-name">strich-make-init-elisp</span> <span class="org-rainbow-delimiters-depth-2">()</span>
  <span class="org-doc">"Make `</span><span class="org-doc"><span class="org-constant">strich.el</span></span><span class="org-doc">' with `</span><span class="org-doc"><span class="org-constant">org-babel-tangle</span></span><span class="org-doc">'."</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">interactive</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">with-current-buffer</span>
      <span class="org-rainbow-delimiters-depth-3">(</span>find-file-noselect strich-locate-strich-org-file<span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-rainbow-delimiters-depth-3">(</span>org-babel-tangle<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>write-region <span class="org-rainbow-delimiters-depth-3">(</span>concat <span class="org-string">";; Local Variables&#58;\n"</span>
                        <span class="org-string">";; buffer-read-only: t\n"</span>
                        <span class="org-string">";; End:"</span><span class="org-rainbow-delimiters-depth-3">)</span>
                nil strich-locate-strich-elisp-file 'append<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>message <span class="org-string">"%s is created!"</span> strich-locate-strich-elisp-file<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defun</span> <span class="org-function-name">strich-make-document-html</span> <span class="org-rainbow-delimiters-depth-2">()</span>
  <span class="org-doc">"Make document html file."</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">interactive</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>straight-use-package 'org<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>straight-use-package 'htmlize<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">with-current-buffer</span> <span class="org-rainbow-delimiters-depth-3">(</span>find-file-noselect strich-locate-strich-org-file<span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">setq-local</span> org-html-htmlize-output-type 'css<span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-rainbow-delimiters-depth-3">(</span>org-html-export-to-html<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb7f6f25" class="outline-3">
<h3 id="orgb7f6f25"><span class="section-number-3">2.3</span> Package manager</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Strich はパッケージマネージャとして <code>straight.el</code> と <code>use-package.el</code> を利用します
</p>
</div>

<ol class="org-ol">
<li><a id="org2dbd7a8"></a>straight.el<br />
<div class="outline-text-4" id="text-2-3-1">
<p>
<a href="https://github.com/raxod502/straight.el">straight.el</a> は Emacs のパッケージマネージャの 1 つです．
</p>

<blockquote>
<p>
next-generation, purely functional package manager for the Emacs hacker.
</p>
</blockquote>

<p>
<code>develop</code> ブランチの <code>straight.el</code> をインストールします．
</p>

<p>
デフォルトのままでは Emacs の起動が遅くなるので <code>straight-check-for-modifications</code> を <code>live-with-find</code> に設定しておきます．
<code>live-with-find</code> は <code>(check-on-save find-when-checking)</code> と等価です．
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> straight-repository-branch <span class="org-string">"develop"</span><span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-comment-delimiter">; </span><span class="org-comment">use the develop branch of straight.el</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> straight-check-for-modifications 'live-with-find<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-comment-delimiter">; </span><span class="org-comment">=&gt; '(check-on-save find-when-checking)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defvar</span> <span class="org-variable-name">bootstrap-version</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">let</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-rainbow-delimiters-depth-3">(</span>bootstrap-file
       <span class="org-rainbow-delimiters-depth-4">(</span>expand-file-name <span class="org-string">"straight/repos/straight.el/bootstrap.el"</span> user-emacs-directory<span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span>
      <span class="org-rainbow-delimiters-depth-3">(</span>bootstrap-version 5<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">unless</span> <span class="org-rainbow-delimiters-depth-3">(</span>file-exists-p bootstrap-file<span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">with-current-buffer</span>
        <span class="org-rainbow-delimiters-depth-4">(</span>url-retrieve-synchronously
         <span class="org-string">"https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"</span>
         'silent 'inhibit-cookies<span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>goto-char <span class="org-rainbow-delimiters-depth-5">(</span>point-max<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>eval-print-last-sexp<span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>load bootstrap-file nil 'nomessage<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</li>
