strich/strich.org
*** use-package.el
[[https://github.com/jwiegley/use-package][use-package]] を用いてパッケージの設定を feature 単位で記述します．

#+begin_src emacs-lisp
  (straight-use-package 'use-package)
#+end_src

keywords は次の順序で書くようにします:

- =:defines=
- =:functions=
- =:preface=
- =:if= (or =:when=)
- =:straight=
- =:load-path=
- =:commands=
- =:init=
- =:mode=
- =:interpreter=
- =:hook=
- =:bind=
- =:demand=
- =:after=
- =:custom=
- =:config=
- =:blackout= 

~:preface~ は ~:if~ 節の判定に関わらず読み込まれます．
他パッケージで定義される変数や関数を用いる場合 ~:defines~ や ~:functions~ に列挙しておくのが安全なようです．
基本的に ~straight.el~ を用いてパッケージをインストールするようにします．
また，パッケージは常に遅延ロードします．
遅延ロードをさせないときは明示的に =:demand t= を指定します．
遅延ロードの際， =:after= などのキーワードを併用する場合は注意が必要です．
[[https://jwiegley.github.io/use-package/keywords/#after]] を参照してください．

#+begin_src emacs-lisp
  (setq straight-use-package-by-default t)
  (setq use-package-always-defer t)
#+end_src

build-in の機能を用いるため ~use-feature~ マクロを定めます．
~use-feature~ は radian.el を参考にしました．

#+begin_src emacs-lisp
  (defmacro use-feature (name &rest args)
    "Like `use-package', but with `straight-use-package-by-default' disabled."
    (declare (indent defun))
    `(use-package ,name
       :straight nil
       ,@args))
#+end_src

** Some package
いくつかのパッケージを先にインストールします．
これは Emacs 同梱の (古い) バージョンのパッケージの読み込みを避けるためです．

*** Org-mode
2019年3月現在の ~straight.el~ ではデフォルトで最新の Org-mode をインストールすることができます．

#+begin_src emacs-lisp
  (straight-use-package 'org)
#+end_src

*** blackout
[[https://github.com/raxod502/blackout][blackout]] は deminish や delight のように，メジャー・マイナーモードのモードラインの表示をカスタマイズできます．

#+begin_src emacs-lisp
  (use-package blackout
    :straight (:host github :repo "raxod502/blackout")
    :demand t)
#+end_src

*** all-the-icons
いくつかのパッケージで ~all-the-icons~ のフォントを使用します．
フォントが未インストールの場合，自動的にインストールします．

#+begin_src emacs-lisp
  (use-package all-the-icons
    :demand t
    :config
    (unless (member "all-the-icons" (font-family-list))
      (all-the-icons-install-fonts t)))
#+end_src

* Utilities
** Language, Codings
日本語かつ UTF8 を使用するようにします．

#+begin_src emacs-lisp
  (set-language-environment "Japanese")
  (prefer-coding-system 'utf-8)
#+end_src

また Linux 使用時は ~mozc~ を用いて日本語入力を行います．
別途 ~emacs-mozc-bin~ をインストールする必要があります．

#+begin_src emacs-lisp
  (use-package mozc
    :if (eq system-type 'gnu/linux)
    :demand t
    :config
    (setq default-input-method "japanese-mozc"))
#+end_src

macOS 使用時はファイル名の文字コードの問題があります．

#+begin_src emacs-lisp
  (use-feature ucs-normalize
    :if (eq system-type 'darwin)
    :demand t
    :config
    (set-file-name-coding-system 'utf-8-hfs)
    (setq locale-coding-system 'utf-8-hfs))
#+end_src

** Exec path
ログインシェルの環境変数を引き継ぎます．

#+begin_src emacs-lisp
  (use-package exec-path-from-shell
    :if (memq window-system '(mac ns))
    :demand t
    :config
    (exec-path-from-shell-initialize))
#+end_src

** Server
Emacs 起動後に =server-start= します．

#+begin_src emacs-lisp
(use-feature server
  :hook (after-init . server-mode))
#+end_src

** Backup files
自動バックアップとオートセーブファイルを ~.emacs.d/backups~ に集めます．
~.emacs.d/backups~ はカスタム変数 =strich-backup-directory= で変更できます．

#+begin_src emacs-lisp
  (setq backup-directory-alist
        `((".*" . ,strich-backup-directory)))
  (setq auto-save-file-name-transforms
        `((".*" ,strich-backup-directory t)))
#+end_src

** Directories
*** dired
~dired-mode~ の際，ファイルのアイコンを表示するようにします．

#+begin_src emacs-lisp
  (use-package all-the-icons-dired
    :if (window-system)
    :hook (dired-mode . all-the-icons-dired-mode))
#+end_src

