strich/doc/index.html

<li><a id="org6904c55"></a>use-package.el<br />
<div class="outline-text-4" id="text-2-3-2">
<p>
<a href="https://github.com/jwiegley/use-package">use-package</a> を用いてパッケージの設定を feature 単位で記述します．
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>straight-use-package 'use-package<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
keywords は次の順序で書くようにします:
</p>

<ul class="org-ul">
<li><code>:defines</code></li>
<li><code>:functions</code></li>
<li><code>:preface</code></li>
<li><code>:if</code> (or <code>:when</code>)</li>
<li><code>:straight</code></li>
<li><code>:load-path</code></li>
<li><code>:commands</code></li>
<li><code>:init</code></li>
<li><code>:mode</code></li>
<li><code>:interpreter</code></li>
<li><code>:hook</code></li>
<li><code>:bind</code></li>
<li><code>:demand</code></li>
<li><code>:after</code></li>
<li><code>:custom</code></li>
<li><code>:config</code></li>
<li><code>:blackout</code></li>
</ul>

<p>
<code>:preface</code> は <code>:if</code> 節の判定に関わらず読み込まれます．
他パッケージで定義される変数や関数を用いる場合 <code>:defines</code> や <code>:functions</code> に列挙しておくのが安全なようです．
基本的に <code>straight.el</code> を用いてパッケージをインストールするようにします．
また，パッケージは常に遅延ロードします．
遅延ロードをさせないときは明示的に <code>:demand t</code> を指定します．
遅延ロードの際， <code>:after</code> などのキーワードを併用する場合は注意が必要です．
<a href="https://jwiegley.github.io/use-package/keywords/#after">https://jwiegley.github.io/use-package/keywords/#after</a> を参照してください．
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> straight-use-package-by-default t<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> use-package-always-defer t<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
build-in の機能を用いるため <code>use-feature</code> マクロを定めます．
<code>use-feature</code> は radian.el を参考にしました．
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defmacro</span> <span class="org-function-name">use-feature</span> <span class="org-rainbow-delimiters-depth-2">(</span>name <span class="org-type">&amp;rest</span> args<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-doc">"Like `</span><span class="org-doc"><span class="org-constant">use-package</span></span><span class="org-doc">', but with `</span><span class="org-doc"><span class="org-constant">straight-use-package-by-default</span></span><span class="org-doc">' disabled."</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">declare</span> <span class="org-rainbow-delimiters-depth-3">(</span>indent defun<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
  `<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">use-package</span> ,name
     <span class="org-builtin">:straight</span> nil
     ,@args<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org5210128" class="outline-3">
<h3 id="org5210128"><span class="section-number-3">2.4</span> Some package</h3>
<div class="outline-text-3" id="text-2-4">
<p>
いくつかのパッケージを先にインストールします．
これは Emacs 同梱の (古い) バージョンのパッケージの読み込みを避けるためです．
</p>
</div>

<ol class="org-ol">
<li><a id="org83831e4"></a>Org-mode<br />
<div class="outline-text-4" id="text-2-4-1">
<p>
2019年3月現在の <code>straight.el</code> ではデフォルトで最新の Org-mode をインストールすることができます．
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>straight-use-package 'org<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</li>

<li><a id="orga7f3f64"></a>blackout<br />
<div class="outline-text-4" id="text-2-4-2">
<p>
<a href="https://github.com/raxod502/blackout">blackout</a> は deminish や delight のように，メジャー・マイナーモードのモードラインの表示をカスタマイズできます．
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">blackout</span>
  <span class="org-builtin">:straight</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-builtin">:host</span> github <span class="org-builtin">:repo</span> <span class="org-string">"raxod502/blackout"</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-builtin">:demand</span> t<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org7cabd72"></a>all-the-icons<br />
<div class="outline-text-4" id="text-2-4-3">
<p>
いくつかのパッケージで <code>all-the-icons</code> のフォントを使用します．
フォントが未インストールの場合，自動的にインストールします．
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">all-the-icons</span>
  <span class="org-builtin">:demand</span> t
  <span class="org-builtin">:config</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">unless</span> <span class="org-rainbow-delimiters-depth-3">(</span>member <span class="org-string">"all-the-icons"</span> <span class="org-rainbow-delimiters-depth-4">(</span>font-family-list<span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-rainbow-delimiters-depth-3">(</span>all-the-icons-install-fonts t<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-orgc6561c8" class="outline-2">
<h2 id="orgc6561c8"><span class="section-number-2">3</span> Utilities</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org86e2662" class="outline-3">
<h3 id="org86e2662"><span class="section-number-3">3.1</span> Language, Codings</h3>
<div class="outline-text-3" id="text-3-1">
<p>
日本語かつ UTF8 を使用するようにします．
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>set-language-environment <span class="org-string">"Japanese"</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>prefer-coding-system 'utf-8<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
また Linux 使用時は <code>mozc</code> を用いて日本語入力を行います．
別途 <code>emacs-mozc-bin</code> をインストールする必要があります．
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">mozc</span>
  <span class="org-builtin">:if</span> <span class="org-rainbow-delimiters-depth-2">(</span>eq system-type 'gnu/linux<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-builtin">:demand</span> t
  <span class="org-builtin">:config</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">setq</span> default-input-method <span class="org-string">"japanese-mozc"</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
macOS 使用時はファイル名の文字コードの問題があります．
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-feature</span> ucs-normalize
  <span class="org-builtin">:if</span> <span class="org-rainbow-delimiters-depth-2">(</span>eq system-type 'darwin<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-builtin">:demand</span> t
  <span class="org-builtin">:config</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>set-file-name-coding-system 'utf-8-hfs<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">setq</span> locale-coding-system 'utf-8-hfs<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org346b3c2" class="outline-3">
<h3 id="org346b3c2"><span class="section-number-3">3.2</span> Exec path</h3>
<div class="outline-text-3" id="text-3-2">
<p>
ログインシェルの環境変数を引き継ぎます．
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">exec-path-from-shell</span>
  <span class="org-builtin">:if</span> <span class="org-rainbow-delimiters-depth-2">(</span>memq window-system '<span class="org-rainbow-delimiters-depth-3">(</span>mac ns<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-builtin">:demand</span> t
  <span class="org-builtin">:config</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>exec-path-from-shell-initialize<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgddd4c26" class="outline-3">
<h3 id="orgddd4c26"><span class="section-number-3">3.3</span> Server</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Emacs 起動後に <code>server-start</code> します．
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-feature</span> server
  <span class="org-builtin">:hook</span> <span class="org-rainbow-delimiters-depth-2">(</span>after-init . server-mode<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd9486e5" class="outline-3">
<h3 id="orgd9486e5"><span class="section-number-3">3.4</span> Backup files</h3>
<div class="outline-text-3" id="text-3-4">
<p>
自動バックアップとオートセーブファイルを <code>.emacs.d/backups</code> に集めます．
<code>.emacs.d/backups</code> はカスタム変数 <code>strich-backup-directory</code> で変更できます．
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> backup-directory-alist
      `<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">".*"</span> . ,strich-backup-directory<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> auto-save-file-name-transforms
      `<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">".*"</span> ,strich-backup-directory t<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcb1ca95" class="outline-3">
<h3 id="orgcb1ca95"><span class="section-number-3">3.5</span> Directories</h3>
<div class="outline-text-3" id="text-3-5">
</div>
<ol class="org-ol">
<li><a id="org33987b2"></a>dired<br />
<div class="outline-text-4" id="text-3-5-1">
<p>
<code>dired-mode</code> の際，ファイルのアイコンを表示するようにします．
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">all-the-icons-dired</span>
  <span class="org-builtin">:if</span> <span class="org-rainbow-delimiters-depth-2">(</span>window-system<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-builtin">:hook</span> <span class="org-rainbow-delimiters-depth-2">(</span>dired-mode . all-the-icons-dired-mode<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</li>
