strich/strich.org
*** neotree
ツリープラグインとして [[https://github.com/jaypei/emacs-neotree][neotree]] を用います．
~C-c t~ で起動します．
GUI での使用の際，all-the-icons を用いてアイコンを表示するようにします．

#+begin_src emacs-lisp
  (use-package neotree
    :bind (("C-c t" . neotree-toggle))
    :custom
    (neo-theme (if (display-graphic-p)
                   'classic
                 'arrow)))
#+end_src

** Candidates
