strich/doc/index.html

<li><a id="orgc14ba7b"></a>neotree<br />
<div class="outline-text-4" id="text-3-5-2">
<p>
ツリープラグインとして <a href="https://github.com/jaypei/emacs-neotree">neotree</a> を用います．
<code>C-c t</code> で起動します．
GUI での使用の際，all-the-icons を用いてアイコンを表示するようにします．
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">neotree</span>
  <span class="org-builtin">:bind</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"C-c t"</span> . neotree-toggle<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-builtin">:custom</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>neo-theme <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-4">(</span>display-graphic-p<span class="org-rainbow-delimiters-depth-4">)</span>
                 'classic
               'arrow<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</li>
</ol>
</div>
