strich/strich.org
*** Ivy, Counsel and swiper
補完インターフェイスとして [[https://github.com/abo-abo/swiper][Ivy/Counsel]] を利用します．
詳しい使い方は[[https://oremacs.com/swiper/][ユーザマニュアル]]を参照してください．

#+begin_src emacs-lisp
  (use-package counsel
    :hook ((after-init . ivy-mode)
           (ivy-mode . counsel-mode))
    :bind (("C-s" . swiper)
           ("C-r" . swiper)
           ("C-S-s" . swiper-all)
           ("C-c C-r" . ivy-resume)
           :map ivy-minibuffer-map
           ("<tab>" . ivy-alt-done)
           ("C-w" . ivy-yank-word))
    :custom
    (ivy-use-virtual-buffers t)
    (ivy-count-format "(%d/%d) ")
    (ivy-wrap t)
    (ivy-format-function 'ivy-format-function-arrow)
    (counsel-yank-pop "\n---------\n")
    (ivy-initial-inputs-alist nil)
    :blackout t)
#+end_src

[[https://github.com/Yevgnen/ivy-rich][ivy-rich]] を用いてバッファ切り替えの際などにアイコンを表示するようにします．

#+begin_src emacs-lisp
  (use-package ivy-rich
    :defines (all-the-icons-dir-icon-alist)
    :functions (all-the-icons-icon-family
                all-the-icons-icon-for-mode
                all-the-icons-icon-for-file
                all-the-icons-octicon
                all-the-icons-match-to-alist)
    :preface
    (defun strich-ivy-rich-buffer-icon (candidate)
      "Show buffer isons in `ivy-rich', only on GUI."
      (when (display-graphic-p)
        (with-current-buffer
            (get-buffer candidate)
          (let ((icon (all-the-icons-icon-for-mode major-mode)))
            (if (symbolp icon)
                (all-the-icons-icon-for-mode 'fundamental-mode)
              icon)))))
    (defun strich-ivy-rich-file-icon (candidate)
      "Show file icons in `ivy-rich', only on GUI."
      (when (display-graphic-p)
        (let ((icon
               ;; for directories
               (if (file-directory-p candidate)
                   (cond
                    ;; for `tramp-mode'
                    ((and (fboundp 'tramp-tramp-file-p)
                          (tramp-tramp-file-p default-directory))
                     (all-the-icons-octicon "file-directory"))
                    ;; for symbolic links
                    ((file-symlink-p candidate)
                     (all-the-icons-octicon "file-symlink-directory"))
                    ;; for git submodules
                    ((all-the-icons-dir-is-submodule candidate)
                     (all-the-icons-octicon "file-submodule"))
                    ;; for version-controled by git
                    ((file-exists-p (format "%s/.git" candidate))
                     (all-the-icons-octicon "repo"))
                    ;; otherwise
                    (t (let ((matcher (all-the-icons-match-to-alist candidate all-the-icons-dir-icon-alist)))
                         (apply (car matcher) (list (cadr matcher))))))
                 ;; for files
                 (all-the-icons-icon-for-file candidate))))
          (unless (symbolp icon)
            (propertize icon
                        'face `(:family ,(all-the-icons-icon-family icon) :height 1.1))))))
    :hook (ivy-mode . ivy-rich-mode)
    :custom
    (ivy-rich-path-style 'abbrev)
    (ivy-rich-display-transformers-list
     '(ivy-switch-buffer
       (:columns
        ((strich-ivy-rich-buffer-icon :width 2)
         (ivy-rich-candidate (:width 30))
         (ivy-rich-switch-buffer-size (:width 7))
         (ivy-rich-switch-buffer-indicators (:width 4 :face error :align left))
         (ivy-rich-switch-buffer-major-mode (:width 12 :face warning))
         (ivy-rich-switch-buffer-project (:width 15 :face success))
         (ivy-rich-switch-buffer-path (:width (lambda (x) (ivy-rich-switch-buffer-shorten-path x (ivy-rich-minibuffer-width 0.3))))))
        :predicate
        (lambda (cand) (get-buffer cand)))
       counsel-M-x
       (:columns
        ((counsel-M-x-transformer (:width 40))
         (ivy-rich-counsel-function-docstring (:face font-lock-doc-face))))
       counsel-describe-function
       (:columns
        ((counsel-describe-function-transformer (:width 40))
         (ivy-rich-counsel-function-docstring (:face font-lock-doc-face))))
       counsel-describe-variable
       (:columns
        ((counsel-describe-variable-transformer (:width 40))
         (ivy-rich-counsel-variable-docstring (:face font-lock-doc-face))))
       counsel-recentf
       (:columns
        ((ivy-rich-candidate (:width 0.8))
         (ivy-rich-file-last-modified-time (:face font-lock-comment-face))))
       counsel-find-file
       (:columns
        ((strich-ivy-rich-file-icon :width 2)
         (ivy-rich-candidate)))
       counsel-git
       (:columns
        ((strich-ivy-rich-file-icon :width 2)
         (ivy-rich-candidate)))))
    :blackout t)
#+end_src

[[https://github.com/DarwinAwardWinner/amx][amx]] を用いて ~M-x~ を ivy と統合します．

#+begin_src emacs-lisp
  (use-package amx
    :hook (ivy-mode . amx-mode))
#+end_src

