strich/doc/index.html

<div id="outline-container-org9188e38" class="outline-3">
<h3 id="org9188e38"><span class="section-number-3">3.6</span> Candidates</h3>
<div class="outline-text-3" id="text-3-6">
</div>
<ol class="org-ol">
<li><a id="org3f65c79"></a>Ivy, Counsel and swiper<br />
<div class="outline-text-4" id="text-3-6-1">
<p>
補完インターフェイスとして <a href="https://github.com/abo-abo/swiper">Ivy/Counsel</a> を利用します．
詳しい使い方は<a href="https://oremacs.com/swiper/">ユーザマニュアル</a>を参照してください．
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">counsel</span>
  <span class="org-builtin">:hook</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-rainbow-delimiters-depth-3">(</span>after-init . ivy-mode<span class="org-rainbow-delimiters-depth-3">)</span>
         <span class="org-rainbow-delimiters-depth-3">(</span>ivy-mode . counsel-mode<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-builtin">:bind</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"C-s"</span> . swiper<span class="org-rainbow-delimiters-depth-3">)</span>
         <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"C-r"</span> . swiper<span class="org-rainbow-delimiters-depth-3">)</span>
         <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"C-S-s"</span> . swiper-all<span class="org-rainbow-delimiters-depth-3">)</span>
         <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"C-c C-r"</span> . ivy-resume<span class="org-rainbow-delimiters-depth-3">)</span>
         <span class="org-builtin">:map</span> ivy-minibuffer-map
         <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"&lt;tab&gt;"</span> . ivy-alt-done<span class="org-rainbow-delimiters-depth-3">)</span>
         <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"C-w"</span> . ivy-yank-word<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-builtin">:custom</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>ivy-use-virtual-buffers t<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>ivy-count-format <span class="org-string">"(%d/%d) "</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>ivy-wrap t<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>ivy-format-function 'ivy-format-function-arrow<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>counsel-yank-pop <span class="org-string">"\n---------\n"</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>ivy-initial-inputs-alist nil<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-builtin">:blackout</span> t<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
<a href="https://github.com/Yevgnen/ivy-rich">ivy-rich</a> を用いてバッファ切り替えの際などにアイコンを表示するようにします．
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">ivy-rich</span>
  <span class="org-builtin">:defines</span> <span class="org-rainbow-delimiters-depth-2">(</span>all-the-icons-dir-icon-alist<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-builtin">:functions</span> <span class="org-rainbow-delimiters-depth-2">(</span>all-the-icons-icon-family
              all-the-icons-icon-for-mode
              all-the-icons-icon-for-file
              all-the-icons-octicon
              all-the-icons-match-to-alist<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-builtin">:preface</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">defun</span> <span class="org-function-name">strich-ivy-rich-buffer-icon</span> <span class="org-rainbow-delimiters-depth-3">(</span>candidate<span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-doc">"Show buffer isons in `</span><span class="org-doc"><span class="org-constant">ivy-rich</span></span><span class="org-doc">', only on GUI."</span>
    <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">when</span> <span class="org-rainbow-delimiters-depth-4">(</span>display-graphic-p<span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-keyword">with-current-buffer</span>
          <span class="org-rainbow-delimiters-depth-5">(</span>get-buffer candidate<span class="org-rainbow-delimiters-depth-5">)</span>
        <span class="org-rainbow-delimiters-depth-5">(</span><span class="org-keyword">let</span> <span class="org-rainbow-delimiters-depth-6">(</span><span class="org-rainbow-delimiters-depth-7">(</span>icon <span class="org-rainbow-delimiters-depth-8">(</span>all-the-icons-icon-for-mode major-mode<span class="org-rainbow-delimiters-depth-8">)</span><span class="org-rainbow-delimiters-depth-7">)</span><span class="org-rainbow-delimiters-depth-6">)</span>
          <span class="org-rainbow-delimiters-depth-6">(</span><span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-7">(</span>symbolp icon<span class="org-rainbow-delimiters-depth-7">)</span>
              <span class="org-rainbow-delimiters-depth-7">(</span>all-the-icons-icon-for-mode 'fundamental-mode<span class="org-rainbow-delimiters-depth-7">)</span>
            icon<span class="org-rainbow-delimiters-depth-6">)</span><span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">defun</span> <span class="org-function-name">strich-ivy-rich-file-icon</span> <span class="org-rainbow-delimiters-depth-3">(</span>candidate<span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-doc">"Show file icons in `</span><span class="org-doc"><span class="org-constant">ivy-rich</span></span><span class="org-doc">', only on GUI."</span>
    <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">when</span> <span class="org-rainbow-delimiters-depth-4">(</span>display-graphic-p<span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-keyword">let</span> <span class="org-rainbow-delimiters-depth-5">(</span><span class="org-rainbow-delimiters-depth-6">(</span>icon
             <span class="org-comment-delimiter">;; </span><span class="org-comment">for directories</span>
             <span class="org-rainbow-delimiters-depth-7">(</span><span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-8">(</span>file-directory-p candidate<span class="org-rainbow-delimiters-depth-8">)</span>
                 <span class="org-rainbow-delimiters-depth-8">(</span><span class="org-keyword">cond</span>
                  <span class="org-comment-delimiter">;; </span><span class="org-comment">for `</span><span class="org-comment"><span class="org-constant">tramp-mode</span></span><span class="org-comment">'</span>
                  <span class="org-rainbow-delimiters-depth-9">(</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">and</span> <span class="org-rainbow-delimiters-depth-2">(</span>fboundp 'tramp-tramp-file-p<span class="org-rainbow-delimiters-depth-2">)</span>
                        <span class="org-rainbow-delimiters-depth-2">(</span>tramp-tramp-file-p default-directory<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
                   <span class="org-rainbow-delimiters-depth-1">(</span>all-the-icons-octicon <span class="org-string">"file-directory"</span><span class="org-rainbow-delimiters-depth-1">)</span><span class="org-rainbow-delimiters-depth-9">)</span>
                  <span class="org-comment-delimiter">;; </span><span class="org-comment">for symbolic links</span>
                  <span class="org-rainbow-delimiters-depth-9">(</span><span class="org-rainbow-delimiters-depth-1">(</span>file-symlink-p candidate<span class="org-rainbow-delimiters-depth-1">)</span>
                   <span class="org-rainbow-delimiters-depth-1">(</span>all-the-icons-octicon <span class="org-string">"file-symlink-directory"</span><span class="org-rainbow-delimiters-depth-1">)</span><span class="org-rainbow-delimiters-depth-9">)</span>
                  <span class="org-comment-delimiter">;; </span><span class="org-comment">for git submodules</span>
                  <span class="org-rainbow-delimiters-depth-9">(</span><span class="org-rainbow-delimiters-depth-1">(</span>all-the-icons-dir-is-submodule candidate<span class="org-rainbow-delimiters-depth-1">)</span>
                   <span class="org-rainbow-delimiters-depth-1">(</span>all-the-icons-octicon <span class="org-string">"file-submodule"</span><span class="org-rainbow-delimiters-depth-1">)</span><span class="org-rainbow-delimiters-depth-9">)</span>
                  <span class="org-comment-delimiter">;; </span><span class="org-comment">for version-controled by git</span>
                  <span class="org-rainbow-delimiters-depth-9">(</span><span class="org-rainbow-delimiters-depth-1">(</span>file-exists-p <span class="org-rainbow-delimiters-depth-2">(</span>format <span class="org-string">"%s/.git"</span> candidate<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
                   <span class="org-rainbow-delimiters-depth-1">(</span>all-the-icons-octicon <span class="org-string">"repo"</span><span class="org-rainbow-delimiters-depth-1">)</span><span class="org-rainbow-delimiters-depth-9">)</span>
                  <span class="org-comment-delimiter">;; </span><span class="org-comment">otherwise</span>
                  <span class="org-rainbow-delimiters-depth-9">(</span>t <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">let</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-rainbow-delimiters-depth-3">(</span>matcher <span class="org-rainbow-delimiters-depth-4">(</span>all-the-icons-match-to-alist candidate all-the-icons-dir-icon-alist<span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
                       <span class="org-rainbow-delimiters-depth-2">(</span>apply <span class="org-rainbow-delimiters-depth-3">(</span>car matcher<span class="org-rainbow-delimiters-depth-3">)</span> <span class="org-rainbow-delimiters-depth-3">(</span>list <span class="org-rainbow-delimiters-depth-4">(</span>cadr matcher<span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span><span class="org-rainbow-delimiters-depth-9">)</span><span class="org-rainbow-delimiters-depth-8">)</span>
               <span class="org-comment-delimiter">;; </span><span class="org-comment">for files</span>
               <span class="org-rainbow-delimiters-depth-8">(</span>all-the-icons-icon-for-file candidate<span class="org-rainbow-delimiters-depth-8">)</span><span class="org-rainbow-delimiters-depth-7">)</span><span class="org-rainbow-delimiters-depth-6">)</span><span class="org-rainbow-delimiters-depth-5">)</span>
        <span class="org-rainbow-delimiters-depth-5">(</span><span class="org-keyword">unless</span> <span class="org-rainbow-delimiters-depth-6">(</span>symbolp icon<span class="org-rainbow-delimiters-depth-6">)</span>
          <span class="org-rainbow-delimiters-depth-6">(</span>propertize icon
                      'face `<span class="org-rainbow-delimiters-depth-7">(</span><span class="org-builtin">:family</span> ,<span class="org-rainbow-delimiters-depth-8">(</span>all-the-icons-icon-family icon<span class="org-rainbow-delimiters-depth-8">)</span> <span class="org-builtin">:height</span> 1.1<span class="org-rainbow-delimiters-depth-7">)</span><span class="org-rainbow-delimiters-depth-6">)</span><span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-builtin">:hook</span> <span class="org-rainbow-delimiters-depth-2">(</span>ivy-mode . ivy-rich-mode<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-builtin">:custom</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>ivy-rich-path-style 'abbrev<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>ivy-rich-display-transformers-list
   '<span class="org-rainbow-delimiters-depth-3">(</span>ivy-switch-buffer
     <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-builtin">:columns</span>
      <span class="org-rainbow-delimiters-depth-5">(</span><span class="org-rainbow-delimiters-depth-6">(</span>strich-ivy-rich-buffer-icon <span class="org-builtin">:width</span> 2<span class="org-rainbow-delimiters-depth-6">)</span>
       <span class="org-rainbow-delimiters-depth-6">(</span>ivy-rich-candidate <span class="org-rainbow-delimiters-depth-7">(</span><span class="org-builtin">:width</span> 30<span class="org-rainbow-delimiters-depth-7">)</span><span class="org-rainbow-delimiters-depth-6">)</span>
       <span class="org-rainbow-delimiters-depth-6">(</span>ivy-rich-switch-buffer-size <span class="org-rainbow-delimiters-depth-7">(</span><span class="org-builtin">:width</span> 7<span class="org-rainbow-delimiters-depth-7">)</span><span class="org-rainbow-delimiters-depth-6">)</span>
       <span class="org-rainbow-delimiters-depth-6">(</span>ivy-rich-switch-buffer-indicators <span class="org-rainbow-delimiters-depth-7">(</span><span class="org-builtin">:width</span> 4 <span class="org-builtin">:face</span> error <span class="org-builtin">:align</span> left<span class="org-rainbow-delimiters-depth-7">)</span><span class="org-rainbow-delimiters-depth-6">)</span>
       <span class="org-rainbow-delimiters-depth-6">(</span>ivy-rich-switch-buffer-major-mode <span class="org-rainbow-delimiters-depth-7">(</span><span class="org-builtin">:width</span> 12 <span class="org-builtin">:face</span> warning<span class="org-rainbow-delimiters-depth-7">)</span><span class="org-rainbow-delimiters-depth-6">)</span>
       <span class="org-rainbow-delimiters-depth-6">(</span>ivy-rich-switch-buffer-project <span class="org-rainbow-delimiters-depth-7">(</span><span class="org-builtin">:width</span> 15 <span class="org-builtin">:face</span> success<span class="org-rainbow-delimiters-depth-7">)</span><span class="org-rainbow-delimiters-depth-6">)</span>
       <span class="org-rainbow-delimiters-depth-6">(</span>ivy-rich-switch-buffer-path <span class="org-rainbow-delimiters-depth-7">(</span><span class="org-builtin">:width</span> <span class="org-rainbow-delimiters-depth-8">(</span><span class="org-keyword">lambda</span> <span class="org-rainbow-delimiters-depth-9">(</span>x<span class="org-rainbow-delimiters-depth-9">)</span> <span class="org-rainbow-delimiters-depth-9">(</span>ivy-rich-switch-buffer-shorten-path x <span class="org-rainbow-delimiters-depth-1">(</span>ivy-rich-minibuffer-width 0.3<span class="org-rainbow-delimiters-depth-1">)</span><span class="org-rainbow-delimiters-depth-9">)</span><span class="org-rainbow-delimiters-depth-8">)</span><span class="org-rainbow-delimiters-depth-7">)</span><span class="org-rainbow-delimiters-depth-6">)</span><span class="org-rainbow-delimiters-depth-5">)</span>
      <span class="org-builtin">:predicate</span>
      <span class="org-rainbow-delimiters-depth-5">(</span><span class="org-keyword">lambda</span> <span class="org-rainbow-delimiters-depth-6">(</span>cand<span class="org-rainbow-delimiters-depth-6">)</span> <span class="org-rainbow-delimiters-depth-6">(</span>get-buffer cand<span class="org-rainbow-delimiters-depth-6">)</span><span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
     counsel-M-x
     <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-builtin">:columns</span>
      <span class="org-rainbow-delimiters-depth-5">(</span><span class="org-rainbow-delimiters-depth-6">(</span>counsel-M-x-transformer <span class="org-rainbow-delimiters-depth-7">(</span><span class="org-builtin">:width</span> 40<span class="org-rainbow-delimiters-depth-7">)</span><span class="org-rainbow-delimiters-depth-6">)</span>
       <span class="org-rainbow-delimiters-depth-6">(</span>ivy-rich-counsel-function-docstring <span class="org-rainbow-delimiters-depth-7">(</span><span class="org-builtin">:face</span> font-lock-doc-face<span class="org-rainbow-delimiters-depth-7">)</span><span class="org-rainbow-delimiters-depth-6">)</span><span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
     counsel-describe-function
     <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-builtin">:columns</span>
      <span class="org-rainbow-delimiters-depth-5">(</span><span class="org-rainbow-delimiters-depth-6">(</span>counsel-describe-function-transformer <span class="org-rainbow-delimiters-depth-7">(</span><span class="org-builtin">:width</span> 40<span class="org-rainbow-delimiters-depth-7">)</span><span class="org-rainbow-delimiters-depth-6">)</span>
       <span class="org-rainbow-delimiters-depth-6">(</span>ivy-rich-counsel-function-docstring <span class="org-rainbow-delimiters-depth-7">(</span><span class="org-builtin">:face</span> font-lock-doc-face<span class="org-rainbow-delimiters-depth-7">)</span><span class="org-rainbow-delimiters-depth-6">)</span><span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
     counsel-describe-variable
     <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-builtin">:columns</span>
      <span class="org-rainbow-delimiters-depth-5">(</span><span class="org-rainbow-delimiters-depth-6">(</span>counsel-describe-variable-transformer <span class="org-rainbow-delimiters-depth-7">(</span><span class="org-builtin">:width</span> 40<span class="org-rainbow-delimiters-depth-7">)</span><span class="org-rainbow-delimiters-depth-6">)</span>
       <span class="org-rainbow-delimiters-depth-6">(</span>ivy-rich-counsel-variable-docstring <span class="org-rainbow-delimiters-depth-7">(</span><span class="org-builtin">:face</span> font-lock-doc-face<span class="org-rainbow-delimiters-depth-7">)</span><span class="org-rainbow-delimiters-depth-6">)</span><span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
     counsel-recentf
     <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-builtin">:columns</span>
      <span class="org-rainbow-delimiters-depth-5">(</span><span class="org-rainbow-delimiters-depth-6">(</span>ivy-rich-candidate <span class="org-rainbow-delimiters-depth-7">(</span><span class="org-builtin">:width</span> 0.8<span class="org-rainbow-delimiters-depth-7">)</span><span class="org-rainbow-delimiters-depth-6">)</span>
       <span class="org-rainbow-delimiters-depth-6">(</span>ivy-rich-file-last-modified-time <span class="org-rainbow-delimiters-depth-7">(</span><span class="org-builtin">:face</span> font-lock-comment-face<span class="org-rainbow-delimiters-depth-7">)</span><span class="org-rainbow-delimiters-depth-6">)</span><span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
     counsel-find-file
     <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-builtin">:columns</span>
      <span class="org-rainbow-delimiters-depth-5">(</span><span class="org-rainbow-delimiters-depth-6">(</span>strich-ivy-rich-file-icon <span class="org-builtin">:width</span> 2<span class="org-rainbow-delimiters-depth-6">)</span>
       <span class="org-rainbow-delimiters-depth-6">(</span>ivy-rich-candidate<span class="org-rainbow-delimiters-depth-6">)</span><span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
     counsel-git
     <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-builtin">:columns</span>
      <span class="org-rainbow-delimiters-depth-5">(</span><span class="org-rainbow-delimiters-depth-6">(</span>strich-ivy-rich-file-icon <span class="org-builtin">:width</span> 2<span class="org-rainbow-delimiters-depth-6">)</span>
       <span class="org-rainbow-delimiters-depth-6">(</span>ivy-rich-candidate<span class="org-rainbow-delimiters-depth-6">)</span><span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-builtin">:blackout</span> t<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
<a href="https://github.com/DarwinAwardWinner/amx">amx</a> を用いて <code>M-x</code> を ivy と統合します．
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">amx</span>
  <span class="org-builtin">:hook</span> <span class="org-rainbow-delimiters-depth-2">(</span>ivy-mode . amx-mode<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</li>
