strich/strich.org
*** emacs-which-key
[[https://github.com/justbur/emacs-which-key][which-key]] を用いてキーバインドを表示させます．

#+begin_src emacs-lisp
  (use-package which-key
    :hook (after-init . which-key-mode)
    :bind (:map which-key-mode-map
                ("C-x DEL" . which-key-C-h-dispatch)
                ("C-c DEL" . which-key-C-h-dispatch))
    :custom
    (which-key-popup-type 'side-window)
    (which-key-side-window-location 'bottom)
    :blackout t)
#+end_src

** Others
*** Parenthesis
対応する括弧類は自動的に挿入し，また強調するようにします．

#+begin_src emacs-lisp
  (use-feature elec-pair
    :hook (after-init . electric-pair-mode))

  (use-feature paren
    :hook (after-init . show-paren-mode)
    :custom
    (show-paren-style 'mixed))

  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

*** Whitespace
~C-c w~ で空白文字を可視化します．

#+begin_src emacs-lisp
  (use-feature whitespace
    :commands (whitespace-mode)
    :bind (("C-c w" . whitespace-mode))
    :custom
    (whitespace-style '(
                        face
                        trailing
                        tabs
                        spaces
                        empty
                        space-mark
                        tab-mark
                        ))
    :blackout t)
#+end_src

*** Cursor
[[https://github.com/Malabarba/beacon][beacon]] を用いてカーソルを目立たせます．

#+begin_src emacs-lisp
  (use-package beacon
    :hook (after-init . beacon-mode)
    :custom
    (beacon-color "yellow"))
#+end_src

*** Region
選択中のリージョンをハイライトします．

#+begin_src emacs-lisp
  (add-hook 'after-init-hook #'transient-mark-mode)
#+end_src

*** Ring bell
エラー時のベル音を消します．

#+begin_src emacs-lisp
  (setq ring-bell-function 'ignore)
#+end_src

* Completion and syntax checking
** Yasnippet
#+begin_src emacs-lisp
  (use-package yasnippet
    :blackout t)
#+end_src

