strich/doc/index.html

<li><a id="org1a38cb2"></a>emacs-which-key<br />
<div class="outline-text-4" id="text-3-6-2">
<p>
<a href="https://github.com/justbur/emacs-which-key">which-key</a> を用いてキーバインドを表示させます．
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">which-key</span>
  <span class="org-builtin">:hook</span> <span class="org-rainbow-delimiters-depth-2">(</span>after-init . which-key-mode<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-builtin">:bind</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-builtin">:map</span> which-key-mode-map
              <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"C-x DEL"</span> . which-key-C-h-dispatch<span class="org-rainbow-delimiters-depth-3">)</span>
              <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"C-c DEL"</span> . which-key-C-h-dispatch<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-builtin">:custom</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>which-key-popup-type 'side-window<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>which-key-side-window-location 'bottom<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-builtin">:blackout</span> t<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org4c13903" class="outline-3">
<h3 id="org4c13903"><span class="section-number-3">3.7</span> Others</h3>
<div class="outline-text-3" id="text-3-7">
</div>
<ol class="org-ol">
<li><a id="orgdf61ca8"></a>Parenthesis<br />
<div class="outline-text-4" id="text-3-7-1">
<p>
対応する括弧類は自動的に挿入し，また強調するようにします．
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-feature</span> elec-pair
  <span class="org-builtin">:hook</span> <span class="org-rainbow-delimiters-depth-2">(</span>after-init . electric-pair-mode<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-feature</span> paren
  <span class="org-builtin">:hook</span> <span class="org-rainbow-delimiters-depth-2">(</span>after-init . show-paren-mode<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-builtin">:custom</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>show-paren-style 'mixed<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">rainbow-delimiters</span>
  <span class="org-builtin">:hook</span> <span class="org-rainbow-delimiters-depth-2">(</span>prog-mode . rainbow-delimiters-mode<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</li>

<li><a id="orgb59544a"></a>Whitespace<br />
<div class="outline-text-4" id="text-3-7-2">
<p>
<code>C-c w</code> で空白文字を可視化します．
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-feature</span> whitespace
  <span class="org-builtin">:commands</span> <span class="org-rainbow-delimiters-depth-2">(</span>whitespace-mode<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-builtin">:bind</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"C-c w"</span> . whitespace-mode<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-builtin">:custom</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>whitespace-style '<span class="org-rainbow-delimiters-depth-3">(</span>
                      face
                      trailing
                      tabs
                      spaces
                      empty
                      space-mark
                      tab-mark
                      <span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-builtin">:blackout</span> t<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org68180b1"></a>Cursor<br />
<div class="outline-text-4" id="text-3-7-3">
<p>
<a href="https://github.com/Malabarba/beacon">beacon</a> を用いてカーソルを目立たせます．
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">beacon</span>
  <span class="org-builtin">:hook</span> <span class="org-rainbow-delimiters-depth-2">(</span>after-init . beacon-mode<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-builtin">:custom</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>beacon-color <span class="org-string">"yellow"</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org4155f9a"></a>Region<br />
<div class="outline-text-4" id="text-3-7-4">
<p>
選択中のリージョンをハイライトします．
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>add-hook 'after-init-hook #'transient-mark-mode<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org8368891"></a>Ring bell<br />
<div class="outline-text-4" id="text-3-7-5">
<p>
エラー時のベル音を消します．
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> ring-bell-function 'ignore<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-org93aee98" class="outline-2">
<h2 id="org93aee98"><span class="section-number-2">4</span> Completion and syntax checking</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org7e020ab" class="outline-3">
<h3 id="org7e020ab"><span class="section-number-3">4.1</span> Yasnippet</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">yasnippet</span>
  <span class="org-builtin">:blackout</span> t<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
