strich/strich.org
** Company
補完には [[https://github.com/company-mode/company-mode][company-mode]] を用います．
各種設定は [[https://github.com/company-mode/company-mode/wiki/Switching-from-AC][Switching from AC]] を参考にしました．
=:bind= キーワードを使うとうまく読み込まないため， =:config= と =define-key= を利用しています

#+begin_src emacs-lisp
  (use-package company
    :hook (after-init . global-company-mode)
    :config
    (define-key company-active-map (kbd "<backtab>") 'company-select-previous)
    (define-key company-active-map (kbd "<tab>") 'company-complete-common-or-cycle)
    (define-key company-active-map (kbd "M-n") nil)
    (define-key company-active-map (kbd "M-p") nil)
    (define-key company-active-map (kbd "C-n") #'company-select-next)
    (define-key company-active-map (kbd "C-p") #'company-select-previous)
    (setq company-idle-delay 0)
    (setq company-selection-wrap-around t)
    (setq company-require-match 'never)
    :blackout t)
#+end_src

[[https://github.com/expez/company-quickhelp][company-quickhelp]] を用いて補完候補のドキュメントを読めるようにしておきます．

#+begin_src emacs-lisp
  (use-package company-quickhelp
    :if (window-system)
    :hook (company-mode . company-quickhelp-mode))
#+end_src

[[https://github.com/sebastiencs/company-box][company-box]] を用いて補完候補にアイコンを表示します．
デフォルトの設定のままだと，アイコンが大きく感じるので適当に調整をします．

#+begin_src emacs-lisp
  (use-package company-box
    :functions (all-the-icons-faicon all-the-icons-octicon all-the-icons-material all-the-icons-alltheicon)
    :preface
    (defvar strich-company-box-icons-all-the-icons
      `((Unknown       . ,(all-the-icons-faicon     "cog"                      :height 0.9))
        (Text          . ,(all-the-icons-octicon    "file-text"                :height 0.9))
        (Method        . ,(all-the-icons-faicon     "cube"                     :height 0.9))
        (Function      . ,(all-the-icons-faicon     "cube"                     :height 0.9))
        (Constructor   . ,(all-the-icons-faicon     "cube"                     :height 0.9))
        (Field         . ,(all-the-icons-faicon     "cog"                      :height 0.9))
        (Variable      . ,(all-the-icons-faicon     "cog"                      :height 0.9))
        (Class         . ,(all-the-icons-faicon     "cogs"                     :height 0.9))
        (Interface     . ,(all-the-icons-material   "share"                    :height 0.9))
        (Module        . ,(all-the-icons-alltheicon "less"                     :height 0.9))
        (Property      . ,(all-the-icons-faicon     "wrench"                   :height 0.9))
        (Unit          . ,(all-the-icons-material   "settings_system_daydream" :height 0.9))
        (Value         . ,(all-the-icons-material   "format_align_right"       :height 0.9))
        (Enum          . ,(all-the-icons-material   "content_copy"             :height 0.9))
        (Keyword       . ,(all-the-icons-material   "filter_center_focus"      :height 0.9))
        (Snippet       . ,(all-the-icons-material   "content_paste"            :height 0.9))
        (Color         . ,(all-the-icons-material   "palette"                  :height 0.9))
        (File          . ,(all-the-icons-faicon     "file"                     :height 0.9))
        (Reference     . ,(all-the-icons-material   "collections_bookmark"     :height 0.9))
        (Folder        . ,(all-the-icons-faicon     "folder"                   :height 0.9))
        (EnumMember    . ,(all-the-icons-material   "format_align_right"       :height 0.9))
        (Constant      . ,(all-the-icons-faicon     "square-o"                 :height 0.9))
        (Struct        . ,(all-the-icons-faicon     "cogs"                     :height 0.9))
        (Event         . ,(all-the-icons-faicon     "bolt"                     :height 0.9))
        (Operator      . ,(all-the-icons-material   "control_point"            :height 0.9))
        (TypeParameter . ,(all-the-icons-faicon     "cogs"                     :height 0.9))
        (Template      . ,(all-the-icons-material   "format_align_center"      :height 0.9))
        ))
    :if (and (window-system)
             (>= emacs-major-version 26))
    :hook (company-mode . company-box-mode)
    :custom
    (company-box-show-single-candidate t)
    (company-box-max-candidates 50)
    :config
    (setq company-box-backends-colors nil)
    (setq company-box-icons-alist 'strich-company-box-icons-all-the-icons)
    :blackout t)
#+end_src

