strich/doc/index.html

<div id="outline-container-orgb5f2c7a" class="outline-3">
<h3 id="orgb5f2c7a"><span class="section-number-3">4.2</span> Company</h3>
<div class="outline-text-3" id="text-4-2">
<p>
補完には <a href="https://github.com/company-mode/company-mode">company-mode</a> を用います．
各種設定は <a href="https://github.com/company-mode/company-mode/wiki/Switching-from-AC">Switching from AC</a> を参考にしました．
<code>:bind</code> キーワードを使うとうまく読み込まないため， <code>:config</code> と <code>define-key</code> を利用しています
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">company</span>
  <span class="org-builtin">:hook</span> <span class="org-rainbow-delimiters-depth-2">(</span>after-init . global-company-mode<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-builtin">:config</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>define-key company-active-map <span class="org-rainbow-delimiters-depth-3">(</span>kbd <span class="org-string">"&lt;backtab&gt;"</span><span class="org-rainbow-delimiters-depth-3">)</span> 'company-select-previous<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>define-key company-active-map <span class="org-rainbow-delimiters-depth-3">(</span>kbd <span class="org-string">"&lt;tab&gt;"</span><span class="org-rainbow-delimiters-depth-3">)</span> 'company-complete-common-or-cycle<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>define-key company-active-map <span class="org-rainbow-delimiters-depth-3">(</span>kbd <span class="org-string">"M-n"</span><span class="org-rainbow-delimiters-depth-3">)</span> nil<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>define-key company-active-map <span class="org-rainbow-delimiters-depth-3">(</span>kbd <span class="org-string">"M-p"</span><span class="org-rainbow-delimiters-depth-3">)</span> nil<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>define-key company-active-map <span class="org-rainbow-delimiters-depth-3">(</span>kbd <span class="org-string">"C-n"</span><span class="org-rainbow-delimiters-depth-3">)</span> #'company-select-next<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>define-key company-active-map <span class="org-rainbow-delimiters-depth-3">(</span>kbd <span class="org-string">"C-p"</span><span class="org-rainbow-delimiters-depth-3">)</span> #'company-select-previous<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">setq</span> company-idle-delay 0<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">setq</span> company-selection-wrap-around t<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">setq</span> company-require-match 'never<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-builtin">:blackout</span> t<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
<a href="https://github.com/expez/company-quickhelp">company-quickhelp</a> を用いて補完候補のドキュメントを読めるようにしておきます．
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">company-quickhelp</span>
  <span class="org-builtin">:if</span> <span class="org-rainbow-delimiters-depth-2">(</span>window-system<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-builtin">:hook</span> <span class="org-rainbow-delimiters-depth-2">(</span>company-mode . company-quickhelp-mode<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
<a href="https://github.com/sebastiencs/company-box">company-box</a> を用いて補完候補にアイコンを表示します．
デフォルトの設定のままだと，アイコンが大きく感じるので適当に調整をします．
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">company-box</span>
  <span class="org-builtin">:functions</span> <span class="org-rainbow-delimiters-depth-2">(</span>all-the-icons-faicon all-the-icons-octicon all-the-icons-material all-the-icons-alltheicon<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-builtin">:preface</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">defvar</span> <span class="org-variable-name">strich-company-box-icons-all-the-icons</span>
    `<span class="org-rainbow-delimiters-depth-3">(</span><span class="org-rainbow-delimiters-depth-4">(</span>Unknown       . ,<span class="org-rainbow-delimiters-depth-5">(</span>all-the-icons-faicon     <span class="org-string">"cog"</span>                      <span class="org-builtin">:height</span> 0.9<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>Text          . ,<span class="org-rainbow-delimiters-depth-5">(</span>all-the-icons-octicon    <span class="org-string">"file-text"</span>                <span class="org-builtin">:height</span> 0.9<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>Method        . ,<span class="org-rainbow-delimiters-depth-5">(</span>all-the-icons-faicon     <span class="org-string">"cube"</span>                     <span class="org-builtin">:height</span> 0.9<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>Function      . ,<span class="org-rainbow-delimiters-depth-5">(</span>all-the-icons-faicon     <span class="org-string">"cube"</span>                     <span class="org-builtin">:height</span> 0.9<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>Constructor   . ,<span class="org-rainbow-delimiters-depth-5">(</span>all-the-icons-faicon     <span class="org-string">"cube"</span>                     <span class="org-builtin">:height</span> 0.9<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>Field         . ,<span class="org-rainbow-delimiters-depth-5">(</span>all-the-icons-faicon     <span class="org-string">"cog"</span>                      <span class="org-builtin">:height</span> 0.9<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>Variable      . ,<span class="org-rainbow-delimiters-depth-5">(</span>all-the-icons-faicon     <span class="org-string">"cog"</span>                      <span class="org-builtin">:height</span> 0.9<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>Class         . ,<span class="org-rainbow-delimiters-depth-5">(</span>all-the-icons-faicon     <span class="org-string">"cogs"</span>                     <span class="org-builtin">:height</span> 0.9<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>Interface     . ,<span class="org-rainbow-delimiters-depth-5">(</span>all-the-icons-material   <span class="org-string">"share"</span>                    <span class="org-builtin">:height</span> 0.9<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>Module        . ,<span class="org-rainbow-delimiters-depth-5">(</span>all-the-icons-alltheicon <span class="org-string">"less"</span>                     <span class="org-builtin">:height</span> 0.9<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>Property      . ,<span class="org-rainbow-delimiters-depth-5">(</span>all-the-icons-faicon     <span class="org-string">"wrench"</span>                   <span class="org-builtin">:height</span> 0.9<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>Unit          . ,<span class="org-rainbow-delimiters-depth-5">(</span>all-the-icons-material   <span class="org-string">"settings_system_daydream"</span> <span class="org-builtin">:height</span> 0.9<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>Value         . ,<span class="org-rainbow-delimiters-depth-5">(</span>all-the-icons-material   <span class="org-string">"format_align_right"</span>       <span class="org-builtin">:height</span> 0.9<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>Enum          . ,<span class="org-rainbow-delimiters-depth-5">(</span>all-the-icons-material   <span class="org-string">"content_copy"</span>             <span class="org-builtin">:height</span> 0.9<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>Keyword       . ,<span class="org-rainbow-delimiters-depth-5">(</span>all-the-icons-material   <span class="org-string">"filter_center_focus"</span>      <span class="org-builtin">:height</span> 0.9<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>Snippet       . ,<span class="org-rainbow-delimiters-depth-5">(</span>all-the-icons-material   <span class="org-string">"content_paste"</span>            <span class="org-builtin">:height</span> 0.9<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>Color         . ,<span class="org-rainbow-delimiters-depth-5">(</span>all-the-icons-material   <span class="org-string">"palette"</span>                  <span class="org-builtin">:height</span> 0.9<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>File          . ,<span class="org-rainbow-delimiters-depth-5">(</span>all-the-icons-faicon     <span class="org-string">"file"</span>                     <span class="org-builtin">:height</span> 0.9<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>Reference     . ,<span class="org-rainbow-delimiters-depth-5">(</span>all-the-icons-material   <span class="org-string">"collections_bookmark"</span>     <span class="org-builtin">:height</span> 0.9<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>Folder        . ,<span class="org-rainbow-delimiters-depth-5">(</span>all-the-icons-faicon     <span class="org-string">"folder"</span>                   <span class="org-builtin">:height</span> 0.9<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>EnumMember    . ,<span class="org-rainbow-delimiters-depth-5">(</span>all-the-icons-material   <span class="org-string">"format_align_right"</span>       <span class="org-builtin">:height</span> 0.9<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>Constant      . ,<span class="org-rainbow-delimiters-depth-5">(</span>all-the-icons-faicon     <span class="org-string">"square-o"</span>                 <span class="org-builtin">:height</span> 0.9<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>Struct        . ,<span class="org-rainbow-delimiters-depth-5">(</span>all-the-icons-faicon     <span class="org-string">"cogs"</span>                     <span class="org-builtin">:height</span> 0.9<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>Event         . ,<span class="org-rainbow-delimiters-depth-5">(</span>all-the-icons-faicon     <span class="org-string">"bolt"</span>                     <span class="org-builtin">:height</span> 0.9<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>Operator      . ,<span class="org-rainbow-delimiters-depth-5">(</span>all-the-icons-material   <span class="org-string">"control_point"</span>            <span class="org-builtin">:height</span> 0.9<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>TypeParameter . ,<span class="org-rainbow-delimiters-depth-5">(</span>all-the-icons-faicon     <span class="org-string">"cogs"</span>                     <span class="org-builtin">:height</span> 0.9<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>Template      . ,<span class="org-rainbow-delimiters-depth-5">(</span>all-the-icons-material   <span class="org-string">"format_align_center"</span>      <span class="org-builtin">:height</span> 0.9<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-builtin">:if</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">and</span> <span class="org-rainbow-delimiters-depth-3">(</span>window-system<span class="org-rainbow-delimiters-depth-3">)</span>
           <span class="org-rainbow-delimiters-depth-3">(</span>&gt;= emacs-major-version 26<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-builtin">:hook</span> <span class="org-rainbow-delimiters-depth-2">(</span>company-mode . company-box-mode<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-builtin">:custom</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>company-box-show-single-candidate t<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>company-box-max-candidates 50<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-builtin">:config</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">setq</span> company-box-backends-colors nil<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">setq</span> company-box-icons-alist 'strich-company-box-icons-all-the-icons<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-builtin">:blackout</span> t<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
