strich/strich.org
** Flycheck
文法チェックには [[https://www.flycheck.org/en/latest/][Flycheck]] を利用します．
後述の [[LSP][LSP]] を用いる場合には暴走するという情報があるので要確認です．

#+begin_src emacs-lisp
  (use-package flycheck
    :hook (after-init . global-flycheck-mode))
#+end_src

エラー内容の表示に [[https://github.com/flycheck/flycheck-popup-tip][flycheck-popup-tip]] を利用します．

#+begin_src emacs-lisp
  (use-package flycheck-popup-tip
    :hook (flycheck-mode . flycheck-popup-tip-mode))
#+end_src

** LSP
* Programming Languages
** C/C++

** Emacs Lisp

** Ocaml

** Python

* Documents
** TeX/LaTeX

** Org-mode

* Appearance
** Color theme
[[https://github.com/hlissner/emacs-doom-themes][doom-themes]] の ~doom-dracula~ テーマを利用する．

#+begin_src emacs-lisp
  (use-package doom-themes
    :demand t
    :custom
    (doom-themes-enable-bold t)
    (doom-themes-enable-italic t)
    (doom-neotree-file-icons t)
    :config
    (load-theme 'doom-dracula t)
    (doom-themes-visual-bell-config)
    (doom-themes-neotree-config)
    (doom-themes-org-config))
#+end_src

またモードラインを [[https://github.com/seagle0128/doom-modeline][doom-modeline]] でカスタマイズする．

#+begin_src emacs-lisp
  (use-package doom-modeline
    :hook (after-init . doom-modeline-mode)
    :custom
    (doom-modeline-buffer-file-name-style 'truncate-upto-project)
    (doom-modeline-icon t)
    (doom-modeline-major-mode-color-icon t)
    (find-file-visit-truename t)
    :config
    (setq doom-modeline-mu4e nil
          doom-modeline-irc nil))
#+end_src

** Frame
ツールバー等，特に必要のないものは表示しないようにする．

#+begin_src emacs-lisp
  (setq inhibit-startup-screen t)
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
  (size-indication-mode +1)
  (setq frame-title-format "%f")
#+end_src

Emacs 26 以上を使用している場合 ~display-line-numbers-mode~ を利用する．
そうでない場合は ~columnu-number-mode~ と ~line-number-mode~ を利用する．

#+begin_src emacs-lisp
  (if (version<= "26.0.50" emacs-version)
      (progn
        (global-display-line-numbers-mode)
        (column-number-mode -1)
        (line-number-mode -1))
    (column-number-mode +1)
    (line-number-mode +1))
#+end_src

Emacs 起動時にフレームを最大化します．

#+begin_src emacs-lisp
  (set-frame-parameter nil 'fullscreen 'maximized)
#+end_src

** Font
#+begin_src emacs-lisp
  (set-face-attribute 'default nil
                      :family "Source Han Code JP"
                      :height 140)
#+end_src
* Global keybindings
global-map のキーバインドを次のように変更します．

#+begin_src emacs-lisp
  (define-key global-map (kbd "C-m") 'newline-and-indent)
  (define-key global-map (kbd "C-2") 'set-mark-command)
  (define-key global-map (kbd "C-t") 'other-window)
  (define-key global-map (kbd "C-;") 'comment-line)
#+end_src

また ~C-h~ を ~DEL~ と入れ替えます．
=help-for-help= は ~C-x ?~ にバインドします．

#+begin_src emacs-lisp
  (define-key key-translation-map (kbd "C-h") (kbd "DEL"))
  (define-key global-map (kbd "C-x ?") 'help-for-help)
#+end_src

