strich/doc/index.html

<div id="outline-container-org2e200f7" class="outline-3">
<h3 id="org2e200f7"><span class="section-number-3">4.3</span> Flycheck</h3>
<div class="outline-text-3" id="text-4-3">
<p>
文法チェックには <a href="https://www.flycheck.org/en/latest/">Flycheck</a> を利用します．
後述の <a href="#orgb79a255">LSP</a> を用いる場合には暴走するという情報があるので要確認です．
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">flycheck</span>
  <span class="org-builtin">:hook</span> <span class="org-rainbow-delimiters-depth-2">(</span>after-init . global-flycheck-mode<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
エラー内容の表示に <a href="https://github.com/flycheck/flycheck-popup-tip">flycheck-popup-tip</a> を利用します．
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">flycheck-popup-tip</span>
  <span class="org-builtin">:hook</span> <span class="org-rainbow-delimiters-depth-2">(</span>flycheck-mode . flycheck-popup-tip-mode<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb79a255" class="outline-3">
<h3 id="orgb79a255"><span class="section-number-3">4.4</span> LSP</h3>
</div>
</div>
<div id="outline-container-org59218df" class="outline-2">
<h2 id="org59218df"><span class="section-number-2">5</span> Programming Languages</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org5081f2c" class="outline-3">
<h3 id="org5081f2c"><span class="section-number-3">5.1</span> C/C++</h3>
</div>

<div id="outline-container-org8cbc663" class="outline-3">
<h3 id="org8cbc663"><span class="section-number-3">5.2</span> Emacs Lisp</h3>
</div>

<div id="outline-container-org022420d" class="outline-3">
<h3 id="org022420d"><span class="section-number-3">5.3</span> Ocaml</h3>
</div>

<div id="outline-container-orgd2e696b" class="outline-3">
<h3 id="orgd2e696b"><span class="section-number-3">5.4</span> Python</h3>
</div>
</div>

<div id="outline-container-orgb7c297b" class="outline-2">
<h2 id="orgb7c297b"><span class="section-number-2">6</span> Documents</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org38d4a48" class="outline-3">
<h3 id="org38d4a48"><span class="section-number-3">6.1</span> TeX/LaTeX</h3>
</div>

<div id="outline-container-orgeb2fdfc" class="outline-3">
<h3 id="orgeb2fdfc"><span class="section-number-3">6.2</span> Org-mode</h3>
</div>
</div>

<div id="outline-container-org00140f2" class="outline-2">
<h2 id="org00140f2"><span class="section-number-2">7</span> Appearance</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org4ab4928" class="outline-3">
<h3 id="org4ab4928"><span class="section-number-3">7.1</span> Color theme</h3>
<div class="outline-text-3" id="text-7-1">
<p>
<a href="https://github.com/hlissner/emacs-doom-themes">doom-themes</a> の <code>doom-dracula</code> テーマを利用する．
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">doom-themes</span>
  <span class="org-builtin">:demand</span> t
  <span class="org-builtin">:custom</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>doom-themes-enable-bold t<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>doom-themes-enable-italic t<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>doom-neotree-file-icons t<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-builtin">:config</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>load-theme 'doom-dracula t<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>doom-themes-visual-bell-config<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>doom-themes-neotree-config<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>doom-themes-org-config<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
またモードラインを <a href="https://github.com/seagle0128/doom-modeline">doom-modeline</a> でカスタマイズする．
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">doom-modeline</span>
  <span class="org-builtin">:hook</span> <span class="org-rainbow-delimiters-depth-2">(</span>after-init . doom-modeline-mode<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-builtin">:custom</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>doom-modeline-buffer-file-name-style 'truncate-upto-project<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>doom-modeline-icon t<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>doom-modeline-major-mode-color-icon t<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>find-file-visit-truename t<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-builtin">:config</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">setq</span> doom-modeline-mu4e nil
        doom-modeline-irc nil<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org38da76a" class="outline-3">
<h3 id="org38da76a"><span class="section-number-3">7.2</span> Frame</h3>
<div class="outline-text-3" id="text-7-2">
<p>
ツールバー等，特に必要のないものは表示しないようにする．
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> inhibit-startup-screen t<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>tool-bar-mode -1<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>scroll-bar-mode -1<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>size-indication-mode +1<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> frame-title-format <span class="org-string">"%f"</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Emacs 26 以上を使用している場合 <code>display-line-numbers-mode</code> を利用する．
そうでない場合は <code>columnu-number-mode</code> と <code>line-number-mode</code> を利用する．
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">(</span>version&lt;= <span class="org-string">"26.0.50"</span> emacs-version<span class="org-rainbow-delimiters-depth-2">)</span>
    <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">progn</span>
      <span class="org-rainbow-delimiters-depth-3">(</span>global-display-line-numbers-mode<span class="org-rainbow-delimiters-depth-3">)</span>
      <span class="org-rainbow-delimiters-depth-3">(</span>column-number-mode -1<span class="org-rainbow-delimiters-depth-3">)</span>
      <span class="org-rainbow-delimiters-depth-3">(</span>line-number-mode -1<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>column-number-mode +1<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>line-number-mode +1<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Emacs 起動時にフレームを最大化します．
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>set-frame-parameter nil 'fullscreen 'maximized<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org4901796" class="outline-3">
<h3 id="org4901796"><span class="section-number-3">7.3</span> Font</h3>
<div class="outline-text-3" id="text-7-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>set-face-attribute 'default nil
                    <span class="org-builtin">:family</span> <span class="org-string">"Source Han Code JP"</span>
                    <span class="org-builtin">:height</span> 140<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org5c9b7b7" class="outline-2">
<h2 id="org5c9b7b7"><span class="section-number-2">8</span> Global keybindings</h2>
<div class="outline-text-2" id="text-8">
<p>
global-map のキーバインドを次のように変更します．
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>define-key global-map <span class="org-rainbow-delimiters-depth-2">(</span>kbd <span class="org-string">"C-m"</span><span class="org-rainbow-delimiters-depth-2">)</span> 'newline-and-indent<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>define-key global-map <span class="org-rainbow-delimiters-depth-2">(</span>kbd <span class="org-string">"C-2"</span><span class="org-rainbow-delimiters-depth-2">)</span> 'set-mark-command<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>define-key global-map <span class="org-rainbow-delimiters-depth-2">(</span>kbd <span class="org-string">"C-t"</span><span class="org-rainbow-delimiters-depth-2">)</span> 'other-window<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>define-key global-map <span class="org-rainbow-delimiters-depth-2">(</span>kbd <span class="org-string">"C-;"</span><span class="org-rainbow-delimiters-depth-2">)</span> 'comment-line<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
また <code>C-h</code> を <code>DEL</code> と入れ替えます．
<code>help-for-help</code> は <code>C-x ?</code> にバインドします．
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>define-key key-translation-map <span class="org-rainbow-delimiters-depth-2">(</span>kbd <span class="org-string">"C-h"</span><span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-rainbow-delimiters-depth-2">(</span>kbd <span class="org-string">"DEL"</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>define-key global-map <span class="org-rainbow-delimiters-depth-2">(</span>kbd <span class="org-string">"C-x ?"</span><span class="org-rainbow-delimiters-depth-2">)</span> 'help-for-help<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
